% 
% f0=[0.01*(x0(1)^3)+1.4*x0(1)-0.6*x0(2)-20; 10*log(x0(2)/8 +1)-0.6*x0(1)+0.6*x0(2)];
%    
% w = [0.03*x0(1)^2+1.4 -0.6; -0.6 (5/(4*x0(2)/8+1))+0.6]
% 
% G=[0.06*x0(1) 0; 0 5/(32*(x0(2)/8+1)^2)]
% x=x0-f0*inv(W+G)
I1=[]; I2=[];
U1=[];
U2=[];

x0=[1; 1]; %начальное приближение
syms i1s i2s; %создаем символьные переменные, чтобы вычислить производную
df11i1s = diff('0.01*(i1s^3) + 1.4*i1s -0.6*i2s -20', i1s); 
df11i2s = diff('0.01*(i1s^3) + 1.4*i1s -0.6*i2s -20', i2s);
%2
df12i1s = diff('10*log(i2s/8 +1)-0.6*i1s+0.6*i2s', i1s); 
df12i2s = diff('10*log(i2s/8 +1)-0.6*i1s+0.6*i2s', i2s);

df21i1s=diff('0.01*(i1s^3) + 1.4*i1s -0.6*i2s -20',2, i1s);
df21i2s=diff('0.01*(i1s^3) + 1.4*i1s -0.6*i2s -20',2, i2s);

df22i1s = diff('10*log(i2s/8 +1)-0.6*i1s+0.6*i2s',2, i1s); 
df22i2s = diff('10*log(i2s/8 +1)-0.6*i1s+0.6*i2s',2, i2s);
%расчет 1 итерации, чтобы получить x
f0=[0.01*(x0(1)^3)+1.4*x0(1)-0.6*x0(2)-20; 10*log(x0(2)/8 +1)-0.6*x0(1)+0.6*x0(2)];


%вычисление значений производных
df11i1= double(subs(subs(df11i1s, i1s, x0(1)), i2s, x0(2)));
df11i2=double(subs(subs(df11i2s, i1s, x0(1)), i2s, x0(2)));

df12i1= double(subs(subs(df12i1s, i1s, x0(1)), i2s, x0(2)));
df12i2=double(subs(subs(df12i2s, i1s, x0(1)),  i2s, x0(2)));

df21i1= double(subs(subs(df21i1s, i1s, x0(1)), i2s, x0(2)));
df21i2=double(subs(subs(df21i2s, i1s, x0(1)), i2s, x0(2)));

df22i1= double(subs(subs(df22i1s, i1s, x0(1)), i2s, x0(2)));
df22i2=double(subs(subs(df22i2s, i1s, x0(1)), i2s, x0(2)));

w=[df11i1 df11i2 ; df12i1 df12i2];
G=[df21i1 df21i2; df22i1 df22i2];
%G=[0.06*x0(1) 0; 0 5/(32*(x0(2)/8+1)^2)];

det(w) % определитель, не должен быть равен 0

x = x0 - inv(w+G)*f0; % решение после 1 итерации
u1=0.01*x(1)^3;
u2=10*log(x(2)/8+1);
I1=[I1;x(1)]; I2=[I2;x(2)];U1=[U1;u1];U2=[U2;u2];
e = 0.001; %точность
k = 1;

%расчет следующих итераций

while ((abs(x(1) - x0(1)) > e) | (abs(x(2) - x0(2)) > e) ) %пока точность не будет достигнута 
    x0(1) = x(1);
    x0(2) = x(2);
   f0=[0.01*(x0(1)^3)+1.4*x0(1)-0.6*x0(2)-20; 10*log(x0(2)/8 +1)-0.6*x0(1)+0.6*x0(2)];
     w = [0.03*x0(1)^2+1.4 -0.6; -0.6 (5/(4*x0(2)/8+1))+0.6]; %матрица якоби 
    det(w); % определитель
    G=[0.06*x0(1) 0; 0 5/(32*(x0(2)/8+1)^2)]
   x = x0 -inv(w+G)*f0;
    u1=0.01*x(1)^3;
    u2=10*log(x(2)/8+1);
    I1=[I1;x(1)]; I2=[I2;x(2)];U1=[U1;u1];U2=[U2;u2];
    k = k + 1; 
    if ( k > 100)
       break;
    end;
end;

U1
U2
figure(1);
plot(I1,U1);
figure(2);
plot(I2,U2);
% u1=0.01*x(1)^3;
% u2=10*log(x(2)/8+1);
% disp('i1=');
% disp(x(1))
% u1
% disp('i2=');
% disp(x(2))
% u2
k