x=[1.2, 1.5, 1.7, 2.0, 2.4, 2.6, 3.1, 3.3, 3.5, 3.9];
y=[5.273, 5.541, 5.812, 6.086, 6.358, 5.624, 6.897, 7.162, 7.433, 7.708];
x0=[1.25, 3.55];
p=polyfit(x,y,9);
y0=polyval(p,x0);
y1=interp1(x,y,x0,'spline'); %т.к. полином очень большой степени и функци€ polyfit 
%предупреждает о возможности большой погрешности при рассчЄтах то
%интерполируем сплайнами и видим что результаты очень отличаютс€..
disp('узлы итерпол€ции:\n');
fprintf('%5s | %5s\n','x','y');
for i=1:10
    fprintf('%5.3f | %5.3f\n',x(i),y(i));
end
disp('точки итерполировани€:\n');
fprintf('%5s | %5s |%5s\n','x0','y0', 'y1');
for i=1:n1
    fprintf('%5.3f | %5.3f | %5.3f\n',x0(i),y0(i), y1(i));
end;


    