n=input('введите количество узловых точек ');
while (n<1)||(n~=floor(n))||~isreal(n)||isnan(n)||~isscalar(n)
    disp('значение не удовлетвор€ет требовани€м - еще разок');
    n=input('введите количество узловых точек ');
end;
A=coordvec(n);
% n=10;
% A=[1.2, 1.5, 1.7, 2.0, 2.4, 2.6, 3.1, 3.3, 3.5, 3.9; 5.273, 5.541, 5.812, 6.086, 6.358, 5.624, 6.897, 7.162, 7.433, 7.708];
x=A(1,:);
y=A(2,:);
n1=input('введите количество точек интерполировани€');
while (n1<1)||(n1~=floor(n1))||~isreal(n1)||isnan(n1)||~isscalar(n1)
    disp('значение не удовлетвор€ет требовани€м - еще раз');
    n1=input('количество точек интерполировани€ ');
end;
x0=[1,n1];
for i=1:n1
  x0(i)=input('введите значение x дл€ интерполировани€ принадлежащее [x(1);x(n)] ');  
  while (x0(i)<A(1,1)) || (x0(i)>A(1,n))
      disp('значение не удовлетвор€ет требовани€м дл€ решени€ задачи - попробуйте снова');
     x0(i)=input('введите значение x дл€ интерполировани€ принадлежащее [x(1);x(n)] ');
  end;
end;
n1=2;
x0=[1.25, 3.55];
y0=interpolka(A,x0,n, n1);
disp('узлы итерпол€ции:');
fprintf('%5s | %5s\n','x','y');
for i=1:n
    fprintf('%5.3f | %5.3f\n',A(1,i),A(2,i));
end;
disp('точки итерполировани€:');
fprintf('%5s | %5s\n','x0','y0');
for i=1:n1
    fprintf('%5.3f | %5.3f\n',x0(i),y0(i));
end;


